Repository: printempstg/craft-5152-en-ro
Catalog: tm/5152_EN-RO-batch2.tmx
Source language: en
Languages: ro

source: VICRYL™ PLUS suture contains Irgacare MP (Triclosan), a broad spectrum antibacterial agent at no more than 270 μg/m.
ro: Firul de sutură VICRYL™ PLUS conţine Irgacare MP (Triclosan), un agent antibacterian cu spectru larg, în cantitate maximă de 270 μg/m.

source: VICRYL™ PLUS suture elicits a minimal initial inflammatory reaction in tissues and ingrowth of fibrous connective tissue.
ro: Firele de sutură VICRYL™ PLUS provoacă o reacţie inflamatorie tisulară iniţială minimă și proliferarea de ţesut conjunctiv fibros.

source: VICRYL™ PLUS suture is a synthetic absorbable sterile surgical suture composed of a copolymer made from 90 % glycolide and 10 % L-lactide.
ro: Firul de sutură VICRYL™ PLUS este un fir de sutură chirurgicală sintetic, absorbabil, steril, fabricat dintr-un copolimer compus în proporţie de 90 % din glicolidă și 10 % din L-lactidă.

source: VICRYL™ PLUS suture should not be used in patients with known allergic reactions to Irgacare MP (Triclosan) .
ro: Firele de sutură VICRYL™ PLUS nu trebuie utilizate la pacienţi cu reacţii alergice cunoscute la Irgacare MP (Triclosan).

source: VICRYL™ PLUS sutures are dyed by adding D+C violet # 2 (Color Index number: 60725) during polymerisation.
ro: Firele de sutură VICRYL™ PLUS sunt vopsite prin adăugarea pigmentului Violet nr. 2 D & C (codul culorii 60725) în cursul polimerizării.

source: VICRYL™ PLUS sutures are intended for use in general soft tissue approximation and/or ligation, including microsurgery for vessels less than 2 mm diameter.
ro: Firele de sutură VICRYL™ PLUS sunt indicate pentru utilizarea în intervenţiile generale de afrontare și/sau ligaturare a ţesuturilor moi, ceea ce include intervenţiile microchirurgicale la nivelul vaselor cu diametrul mai mic de 2 mm.

source: VICRYL™ PLUS sutures are sterilized by ethylene oxide gas.
ro: Firele de sutură VICRYL™ PLUS sunt sterilizate cu gaz de oxid de etilenă.

source: VICRYL™ RAPIDE is also successfully used in ophthalmic surgery for conjunctival sutures.
ro: VICRYL™ rapide este, de asemenea, utilizat cu succes în chirurgia oftalmologică pentru suturile conjunctivale.

source: VICRYL™ RAPIDE is available in a range of gauge sizes and lengths, non-needled or attached to stainless steel needles of varying types and sizes.
ro: VICRYL™ rapide este disponibil într-o gamă variată de diametre și lungimi, fără ace sau atașate la ace din oţel inoxidabil de diverse tipuri și mărimi.

source: VICRYL™ RAPIDE is intended for use in soft tissue approximation where only short term wound support is required and where the rapid absorption of the suture would be beneficial.
ro: Firul de sutură VICRYL™ rapide este destinat utilizării în procedurile de afrontare a ţesuturilor moi, în cazurile în care este necesară doar o susţinere pe termen scurt a plăgii și absorbţia rapidă a suturii ar fi benefică.

source: VICRYL™ RAPIDE suture elicits a minimal to moderate initial inflammatory tissue reaction.
ro: VICRYL™ rapide suscită o reacţie inflamatorie tisulară iniţială minimă până la moderată.

source: VICRYL™ RAPIDE suture is a synthetic absorbable sterile surgical suture composed of a copolymer made from 90% glycolide and 10% L-lactide.
ro: Firul de sutură VICRYL™ rapide este un fir de sutură chirurgicală steril, sintetic, absorbabil, fabricat dintr-un copolimer compus în proporţie de 90 % din glicolidă și 10 % din L-lactidă.

source: VICRYL™ RAPIDE suture is not for use in cardiovascular and neurological tissues.
ro: Firul de sutură VICRYL™ rapide nu este destinat utilizării în intervenţiile de chirurgie cardiovasculară și neurochirurgie.

source: VICRYL™ RAPIDE sutures are available undyed as well as dyed by adding D&C violet No. 2 (Colour Index Number 60725) during polymerisation.
ro: Firele de sutură VICRYL™ rapide sunt vopsite prin adăugarea pigmentului violet nr. 2 D & C (codul culorii 60725) în cursul polimerizării.

source: VICRYL™ RAPIDE sutures are obtained by coating the braided suture material with a copolymer composed of 90% caprolactone and 10% glycolide followed by a mixture composed of equal parts of copolymer of glycolide and lactide (polyglactin 370) and calcium stearate.
ro: Firele de sutură VICRYL™ rapide sunt obţinute prin acoperirea materialului de sutură împletit cu un copolimer compus din 90 % caprolactonă și 10 % glicolidă, urmat de un amestec compus în părţi egale din copolimer de glicolidă și lactidă (polyglactin 370) și stearat de calciu.

source: VICRYL™ RAPIDE typically falls off 7 – 10 days post-operatively or can be wiped off subsequently with sterile gauze.
ro: În mod obișnuit VICRYL™ rapide se desprinde la 7–10 zile după operaţie sau poate fi îndepărtat ulterior prin ștergere cu un tifon steril.

source: VICRYL™ RAPIDE undyed is sterilized by irradiation.
ro: VICRYL™ rapide nevopsit este sterilizat prin iradiere.

source: VICRYL™ RAPIDE violet is sterilized by ethylene oxide gas.
ro: VICRYL™ rapide violet este sterilizat cu oxid de etilenă gazos.

source: VICRYL™ complies with the requirements of the United States Pharmacopoeia for Absorbable Surgical Suture and the European Pharmacopoeia for Sterile Synthetic Absorbable Braided Sutures (except for an occasional slight oversize in some gauges).
ro: VICRYL™ îndeplinește toate cerinţele Farmacopeei SUA privind firele de sutură chirurgicală absorbabile și ale Farmacopeei Europene privind firele de sutură chirurgicală sterile sintetice absorbabile împletite (cu excepţia unei ușoare supradimensionări ocazionale a unor diametre).

source: VICRYL™ has been found to be inert, non antigenic, non pyrogenic and elicit only a slight tissue reaction during absorption.
ro: VICRYL™ s-a dovedit a fi inert, non-antigenic, non-pirogenic, suscitând doar o ușoară reacţie tisulară în timpul absorbţiei.

source: VICRYL™ is available in a range of gauge sizes and lengths, non-needled or attached to stainless steel needles of varying types and sizes.
ro: VICRYL™ sunt disponibile într-o gamă variată de diametre și lungimi, atașate la ace din oţel inoxidabil de diverse tipuri și mărimi.

source: VICRYL™ mesh bag consists of VICRYL™ mesh tied with VICRYL™ sutures dyed and undyed.
ro: Sacul din plasă VICRYL™ constă dintr-o plasă VICRYL™ legată cu fire de sutură VICRYL™, vopsite și nevopsite.

source: VICRYL™ mesh bag is sterilized by Ethylene Oxide.
ro: Sacul de plasă VICRYL™ este sterilizat cu oxid de etilenă.

source: VICRYL™ mesh bag: VICRYL™ mesh bag firstly ensures hemostasis of the organ then temporarily supports the newly formed tissue during the healing process without impairing the blood circulation.
ro: Sacul din plasă VICRYL™: Sacul din plasă VICRYL™ asigură mai întâi hemostaza la nivelul organului, apoi susţine temporar ţesutul nou format în cursul procesului de vindecare, fără a îngreuna circulaţia sanguină.

source: VICRYL™ mesh bags are available in different sizes as perirenal, perisplenic and perihepatic prosthesis to envelop these organs.
ro: Sacii de plasă VICRYL™ sunt disponibili în diverse mărimi, pentru ca protezele perirenale, perisplenice și perihepatice să cuprindă organele respective.

source: VICRYL™ mesh bags are used to achieve hemostasis in traumatic kidney, spleen or liver lesions and in elective surgery of the respective organs.
ro: Sacii de plasă VICRYL™ sunt utilizaţi pentru obţinerea hemostazei în leziunile traumatice de rinichi, splină sau ficat, precum și în chirurgia electivă a organelor respective.

source: VICRYL™ mesh consists of undyed knitted polyglactin 910 fibers, identical in composition to those used in VICRYL™ sutures.
ro: Plasa VICRYL™ este formată din fibre nevopsite, împletite, de poliglactin 910, având compoziţie identică cu cele utilizate la firele de sutură VICRYL™.

source: VICRYL™ suture elicits a minimal initial inflammatory reaction in tissues and ingrowth of fibrous connective tissue.
ro: Firele de sutură VICRYL™ exercită o reacţie iniţială inflamatorie tisulară minimă și proliferarea de ţesut conjunctiv fibros.

source: VICRYL™ suture is a synthetic absorbable sterile surgical suture composed of a copolymer made from 90% glycolide and 10% L-lactide.
ro: Firul de sutură VICRYL™ este un fir de sutură chirurgicală sintetic, absorbabil, steril, fabricat dintr-un copolimer compus în proporţie de 90 % din glicolidă și 10 % din L-lactidă.

source: VICRYL™ suture: All original tensile strength is lost between four and five weeks post implantation.
ro: Firul de sutură VICRYL™: Rezistenţa la tracţiune se pierde în întregime în decurs de patru până la cinci săptămâni de la implantare.

source: VICRYL™ sutures are dyed by adding D+C violet # 2 (Color Index number: 60725) during polymerisation.
ro: Firele de sutură VICRYL™ sunt vopsite prin adăugarea pigmentului Violet nr. 2 D & C (codul culorii 60725) în cursul polimerizării.

source: VICRYL™ sutures are intended for use in general soft tissue approximation and/or ligation, including use in ophthalmic surgery, peripheral nerve anastomosis and microsurgery for vessels less than 2 mm diameter.
ro: Firele de sutură VICRYL™ sunt indicate pentru utilizarea în intervenţiile generale de afrontare și/sau ligaturare a ţesuturilor moi, ceea ce include utilizarea în procedurile oftalmologice, de anastomoză a nervilor periferici și de microchirurgie a vaselor cu diametrul mai mic de 2 mm.

source: VICRYL™ sutures are sterilized by ethylene oxide gas.
ro: Firele de sutură VICRYL™ sunt sterilizate cu gaz de oxid de etilenă.

source: VICRYL™: VICRYL™ absorption occurs by means of hydrolysis, where the copolymer degrades to glycolic and lactic acids which are subsequently metabolized and absorbed in the body.
ro: VICRYL™: Absorbţia VICRYL™ are loc prin intermediul hidrolizei, prin care copolimerul este descompus în acid glicolic și acid lactic, care apoi sunt metabolizaţi și absorbiţi în organism.

source: Vicryl ™ mesh bag can be adapted to the form and size of either kidney, spleen or liver.
ro: Sacul din plasă VICRYL™ poate fi adaptat la forma și dimensiunile rinichiului, splinei sau ficatului.

source: Violet sutures are dyed by adding D & C violet # 2 (Color Index Number 60725).
ro: Firele de sutură de culoare violet sunt vopsite prin adăugarea pigmentului Violet D & C nr. 2 (codul culorii 60725).

source: WARNINGS /PRECAUTIONS /INTERACTIONS
ro: AVERTISMENTE / PRECAUŢII / INTERACŢIUNI

source: WARNINGS/PRECAUTIONS/INT ERACTIONS
ro: AVERTISMENTE / PRECAUŢII / INTERACŢIUNI

source: WARNINGS/PRECAUTIONS/INTERACTIONS
ro: AVERTISMENTE / PRECAUŢII / INTERACŢIUNI

source: When connecting to the pulse generator or extension cable it should be ensured that the isolation bush is pushed to the rear so that good electrical contact is guaranteed.
ro: La conectarea la generatorul de impulsuri sau la cablul de extensie trebuie să vă asigurați că manșonul izolator este împins până în spate astfel încât să se asigure un contact electric corespunzător.

source: When handling this or any other suture material, care should be taken to avoid damage.
ro: Manevrarea acestor materiale de sutură precum și a oricăror altora trebuie realizată cu grijă pentru a evita deteriorarea.

source: When the clip springs open due to the spring load, the zig-zag shaped wire can be removed.
ro: Când clipul se deschide datorită tensiunii arcurilor, electrodul în zig-zag poate fi îndepărtat.

source: adapterplug ø 2 mm
ro: conector tip adaptor ø 2 mm

source: defibrillators, electro-surgical devices).
ro: defibrilator, dispozitive de electrochirurgie).

source: g.
ro: ex.

source: myocardiac pacing wires (needles)
ro: electrozi de stimulare miocardiacă (ace)

source: projecting needle tips).
ro: vârfuri de ace proeminente).

source: snap-off needle ø 1 mm
ro: ac detașabil ø 1 mm

source: sterile synthetic absorbable
ro: STERIL SINTETIC ABSORBABIL

source: with Z-Clip
ro: cu Z-Clip

source: – An implanted temporary cardiac pacing wire means a low-resistance electrical connection to the myocardium.
ro: – Un electrod de stimulare cardiacă temporară implantat reprezintă o conexiune electrică de joasă rezistenţă cu miocardul.

source: – Before using the temporary cardiac pacing wire it should first be established that this device is compatible with all products from other manufacturers which may be required for use.
ro: – Înainte de utilizarea electrodului de stimulare cardiacă temporară se va stabili compatibilitatea dispozitivului cu toate produsele de la alţi producători a căror utilizare ar putea fi necesară.

source: – Concurrent use of NMR imaging is not recommended since displacement and heating of the pacing wires may occur.
ro: – Nu este recomandată utilizarea în paralel a investigaţiilor RMN, deoarece acestea pot conduce la dislocarea și încălzirea electrozilor de stimulare.

source: – For cardiac pacing wires with adapter plugs the instructions for use for connecting the pacing wire to the adapter plug should be followed precisely.
ro: – În cazul electrozilor de stimulare cardiacă cu conectori de tip adaptor, trebuie urmate cu exactitate instrucțiunile de utilizare pentru conectarea electrodului de stimulare la conectorul de tip adaptor.

source: – For troublefree function of the pacing wire care should be taken to ensure that its insulation is not damaged or impaired, for example, by twisting of the pacing wire.
ro: – Pentru o funcţionare fără probleme a electrodului de stimulare trebuie avut grijă ca izolaţia acestuia să nu fie deteriorată sau slăbită, de exemplu prin răsucirea electrodului.

source: – In order to achieve troublefree stimulation it is necessary to check using an appropriate method that the electrical uniformity of all junctions between pulse generator and pacing wire is intact.
ro: – Pentru a obţine o stimulare fără probleme, este necesar să se verifice printr-o metodă corespunzătoare dacă toate conexiunile dintre generatorul de impulsuri și electrodul de stimulare sunt intacte din punct de vedere electric.

source: – Once the pacing wire has been connected to the adapter plugs the plugs should be checked to ensure there are no unattached ends of wire.
ro: – După conectarea electrodului de stimulare la conectorii de tip adaptor, aceștia din urmă trebuie verificaţi pentru a vă asigura că nu există capete de electrod nefixate.

source: – STERILE –
ro: – STERIL –

source: – The pacing wires must be placed in the myocardium in such a way that the risk of injury when extracting the pacing wires is minimised.
ro: – Electrozii de stimulare trebuie poziţionați în miocard în așa fel încât să se reducă la minim riscul producerii leziunilor la extragerea acestora.

source: … with adapter plug
ro: … cu conector tip adaptor

source: … with snapoff needle (without adapter-plug)
ro: … cu ac detașabil (fără conector tip adaptor)
